{
    "GenericAll": "This entity has GenericAll permissions to the  target object.This is also known as full control. This permission allows the trustee to manipulate the target object however they wish.\n\n该实体对目标对象具有通用权限。该实体也称为完全控制。此许可使受托人可以根据自己的意愿操纵目标对象。",
    "MemberOf": "The  controlled object is a member of the group target object.Groups in active directory grant their members any privileges the group itself has. If a group has rights to another principal, users/computers in the group, as well as other groups inside the group inherit those permissions.\n\n受控对象是组目标对象的成员。Active Directory中的组批准了该组本身具有的任何特权。如果一个小组享有另一个委托人的权利，则组中的用户/计算机以及组中的其他组继承了这些权限。",
    "AllExtendedRights": "This entity has the AllExtendedRights permission to the  target object.Extended rights are special rights granted on objects which allow reading of privileged attributes, as well as performing special actions.\n\n该实体对目标对象具有无线电的权限。扩展权利是允许阅读特权属性的对象授予的特殊权利，并执行了特殊诉讼。",
    "AdminTo": "This entity has admin rights to the computer target object.By default, administrators have several ways to perform remote code execution on Windows systems, including via RDP, WMI, WinRM, the Service Control Manager, and remote DCOM execution.Further, administrators have several options for impersonating other users logged onto the system, including plaintext password extraction, token impersonation, and injecting into processes running as another user.Finally, administrators can often disable host-based security controls that would otherwise prevent the aforementioned techniques.\n\nThis entity has admin rights to the computer target object.By default, administrators have several ways to perform remote code execution on Windows systems, including via RDP, WMI, WinRM, the Service Control Manager, and remote DCOM execution.Further, administrators have several options for impersonating other users logged onto the system, including plaintext password extraction, token impersonation, and injecting into processes running as another user.Finally, administrators can often disable host-based否则可以防止上述技术的安全控制。",
    "HasSession": "The user target object has a session on the computer controlled object.When a user authenticates to a computer, they often leave credentials exposed on the system, which can be retrieved through LSASS injection, token manipulation/theft, or injecting into a user's process.Any user that is an administrator to the system has the capability to retrieve the credential material from memory if it still exists.Note: A session does not guarantee credential material is present, only possible.\n\n用户目标对象在计算机受控的对象上具有会话。当用户对计算机进行认证时，他们通常会在系统上显示凭据，可以通过LSASS注入，令牌操作/盗窃或注入用户的过程。",
    "AddMember": "This entity has the ability to add arbitrary principals, including itself, to the group target object. Because of security group delegation, the members of a security group have the same privileges as that group.By adding itself to the group, controlled object will gain the same privileges that target object already has.\n\n该实体具有将任意主体（包括本身）添加到组目标对象的能力。由于安全组委派，安全组的成员具有与该组相同的特权。通过将自己添加到组中，受控对象将获得与目标对象已经具有的相同特权。",
    "ForceChangePassword": "This entity has the capability to change the  target object's password without knowing that user's current password.\n\n该实体有能力在不知道用户当前密码的情况下更改目标对象的密码。",
    "GenericWrite": "This entity has generic write access to the  target object.Generic Write access grants you the ability to write to any non-protected attribute on the target object, including \"members\" for a group, and \"serviceprincipalnames\" for a user\n\n该实体具有对目标对象的通用写入访问权限。代理写入访问授予您能够写入目标对象上任何非保护属性的能力，包括组的“成员”和用户的“ serviceprincipalnames”",
    "Owns": "This entity has ownership of the  target object.The owner of an object is implicitly granted the ability to modify object security descriptors, including the DACL, when the following conditions are met:\nThe OWNER RIGHTS SID (S-1-3-4) is not explicitly granted privileges on the object\n```sh\n(Get-ACL -Path (\"AD:\" + \"CN=Object,DC=example,DC=com\")).Access | Where-Object { $_.IdentityReference -eq \"OWNER RIGHTS\" }\n```\nOR\n\nImplicit owner rights are not blockedImplicit owner rights are not blocked and are therefore abusable when the following conditions are met:The domain's BlockOwnerImplicitRights setting is not in enforcement mode. This setting is defined in the 29th character in the domain's dSHeuristics attribute. When set to 0 or 2, implicit owner rights are not blocked.\n```sh\n$searcher = [adsisearcher]\"\"\n$searcher.SearchRoot = \"LDAP://CN=Directory Service,CN=Windows NT,CN=Services,CN=Configuration,DC=EXAMPLE,DC=LOCAL\"\n$searcher.SearchScope = [System.DirectoryServices.SearchScope]::Base\n$searcher.Filter = \"(objectClass=*)\"\n$searcher.PropertiesToLoad.Add(\"DSHeuristics\") | Out-Null\n$result = $searcher.FindOne()\nWrite-Output \"DSHeuristics: $($result.Properties['DSHeuristics'])\"\n```\nAND EITHER:\n\nThe object is not a computer or derivative of a computer object (e.g., MSA, GMSA)\nOR\n\nThe object is a computer or derivative of a computer object and the owner is a member of the Domain Admins or Enterprise Admins group (or is the SID of either group)\n\n该实体具有目标对象的所有权。当满足以下条件时，对象的所有者被隐式地授予对象安全描述符（包括DACL）的能力：\n所有者权利SID（S-1-3-4）未明确授予对象的特权\n````sh\n（get -acl -path（“ ad：” +“ cn =对象，dc =示例，dc = com”））。访问|where -object {$_。IdentityReference-eq“所有者权利”}\n````````\n或者\n\n隐式所有者权利不是阻止所有者权利的权利，因此当满足以下条件时可滥用：域的Blockownerimplitriprightrightrightriprights设置不在执行模式下。此设置在域的Dsheuristic属性中的第29个字符中定义。设置为0或2时，隐式所有者权利不会被阻止。\n````sh\n$ searcher = [adsisearcher]“”\n$ searcher.searchroot =“ ldap：// cn =目录服务，cn = Windows NT，CN =服务，CN =配置，DC = example，dc = local''\n$ searcher.searchscope = [System.DirectoryServices.SearchScope] :: base\n$ searcher.filter =“（objectClass =*）”\n$ searcher.propertiestoload.add（“ dsheuristics”）|淘汰\n$ result = $ searcher.findone（）\n书面输出“ dsheuristic：$（$ result.properties ['dsheuristics']）”\n````````\n和要么：\n\n该对象不是计算机对象的计算机或导数（例如，MSA，GMSA）\n或者\n\n该对象是计算机对象的计算机或导数，所有者是域名或企业管理员组的成员（或任何一个组的SID）",
    "OwnsLimitedRights": "When specific privileges on an object's DACL are explicitly granted to the \"OWNER RIGHTS\" SID (S-1-3-4), implicit owner rights (e.g., WriteDacl) are blocked, and the owner is granted only the specific privileges granted to OWNER RIGHTS. This can be used to limit the rights of the owner of an object.\n\n明确授予“所有者权利” SID（S-1-3-4）的对象DACL上的具体特权时，隐式所有者权利（例如，WritedAcl）被阻止，并且仅授予所有者仅授予授予所有者权利的特定特权。这可以用来限制对象所有者的权利。",
    "OwnsRaw": "This edge is established from the principal that owns an object to the owned object. This edge is processed further to determine whether implicit owner rights (e.g., WriteDacl) are blocked, which may prevent the owner from compromising the destination object.\n\n该边缘是由拥有对象的原理建立的。进一步处理此边缘，以确定隐式所有者权利（例如，WritedAcl）是否被阻止，这可能会阻止所有者损害目标对象。",
    "WriteDacl": "This entity has permissions to modify the DACL (Discretionary Access Control List) on the  target objectWith write access to the target object's DACL, you can grant yourself any permission you want on the object.\n\n该实体具有在目标对象上修改DACL（可支配访问控制列表）的权限，并在目标对象的DACL上写入访问权限，您可以在对象上授予自己想要的任何许可。",
    "WriteOwner": "This entity has the ability to modify the owner of the  target object.Implicit owner rights are not blocked and are therefore abusable via change in ownership when the following conditions are met:Inheritance is not configured for any privileges explicitly granted to the OWNER RIGHTS SID (S-1-3-4). Non-inherited privileges granted to OWNER RIGHTS are removed when the owner is changed, allowing the new owner to have the full set of implicit owner rights.The domain's BlockOwnerImplicitRights setting is not in enforcement mode. This setting is defined in the 29th character in the domain's dSHeuristics attribute. When set to 0 or 2, implicit owner rights are not blocked.\n```sh\n$searcher = [adsisearcher]\"\"\n$searcher.SearchRoot = \"LDAP://CN=Directory Service,CN=Windows NT,CN=Services,CN=Configuration,DC=EXAMPLE,DC=LOCAL\"\n$searcher.SearchScope = [System.DirectoryServices.SearchScope]::Base\n$searcher.Filter = \"(objectClass=*)\"\n$searcher.PropertiesToLoad.Add(\"DSHeuristics\") | Out-Null\n$result = $searcher.FindOne()\nWrite-Output \"DSHeuristics: $($result.Properties['DSHeuristics'])\"\n```The object is not a computer or a derivative of a computer object (e.g., MSA, GMSA).\n\n该实体具有修改目标对象所有者的能力。规则所有者权利没有被阻止，因此在满足以下条件时可以通过更改所有权滥用：未为任何特权配置任何特权，以明确授予所有者权利SID（S-1-1-3-4）。更改所有者时，授予授予所有者权利的非属性特权将被删除，允许新所有者拥有完整的隐式所有者权利。此设置在域的Dsheuristic属性中的第29个字符中定义。设置为0或2时，隐式所有者权利不会被阻止。\n````sh\n$ searcher = [adsisearcher]“”\n$ searcher.searchroot =“ ldap：// cn =目录服务，cn = Windows NT，CN =服务，CN =配置，DC = example，dc = local''\n$ searcher.searchscope = [System.DirectoryServices.SearchScope] :: base\n$ searcher.filter =“（objectClass =*）”\n$ searcher.propertiestoload.add（“ dsheuristics”）|淘汰\n$ result = $ searcher.findone（）\n书面输出“ dsheuristic：$（$ result.properties ['dsheuristics']）”\n``该对象不是计算机对象的计算机或导数（例如MSA，GMSA）。",
    "WriteOwnerLimitedRights": "When specific privileges on an object's DACL are explicitly granted to the \"OWNER RIGHTS\" SID (S-1-3-4), and inheritance is configured for those permissions, they are inherited by the new object owner after a change in ownership. In this case, implicit owner rights are blocked, and the new owner is granted only the specific inherited privileges granted to OWNER RIGHTS.\n\n当对象DACL上的特定特权明确授予“所有者权利” SID（S-1-3-4），并为这些许可配置继承时，它们将在所有权变更后由新对象所有者继承。在这种情况下，隐性所有者权利被阻止，新所有者仅授予授予所有者权利的特定继承特权。",
    "WriteOwnerRaw": "This edge is established from the principal that can change the owner of an object to the owned object. This edge is processed further to determine whether implicit owner rights (e.g., WriteDacl) are blocked, which may prevent the owner from compromising the destination object.\n\n该边缘是从可以将对象的所有者更改为拥有对象的主的主体中确定的。进一步处理此边缘，以确定隐式所有者权利（例如，WritedAcl）是否被阻止，这可能会阻止所有者损害目标对象。",
    "CanRDP": "This entity has the capability to create a Remote Desktop Connection with the computer target object.Remote Desktop access allows you to enter an interactive session with the target computer. If authenticating as a low privilege user, a privilege escalation may allow you to gain high privileges on the system.Note: This edge does not guarantee privileged execution.\n\n该实体具有使用计算机目标对象创建远程桌面连接的能力。RemoteDesktop访问使您可以使用目标计算机输入交互式会话。如果以低特权用户身份进行身份验证，则特权升级可能使您可以在系统上获得高特权。注意：此优势不能保证特权执行。",
    "ExecuteDCOM": "This entity has membership in the Distributed COM Users local group on the computer target object.This can allow code execution under certain conditions by instantiating a COM object on a remote machine and invoking its methods.\n\n该实体在计算机目标对象上的分布式COM用户本地组中具有成员资格。这可以通过在远程计算机上实例化com对象并调用其方法在某些条件下执行代码。",
    "AllowedToDelegate": "The  controlled object has the constrained delegation permission to the computer target object.The constrained delegation primitive allows a principal to authenticate as any user to specific services (found in the msds-AllowedToDelegateTo LDAP property in the source node tab) on the target computer. That is, a node with this permission can impersonate any domain principal (including Domain Admins) to the specific service on the target host. One caveat- impersonated users can not be in the \"Protected Users\" security group or otherwise have delegation privileges revoked.An issue exists in the constrained delegation where the service name (sname) of the resulting ticket is not a part of the protected ticket information, meaning that an attacker can modify the target service name to any service of their choice. For example, if msds-AllowedToDelegateTo is \"HTTP/host.domain.com\", tickets can be modified for LDAP/HOST/etc. service names, resulting in complete server compromise, regardless of the specific service listed.\n\n受控对象具有对计算机目标对象的委托书的约束权限。受约束的授权原始允许委托人作为对特定服务的任何用户（在源节点节点选项卡中的MSDS-allowedTodeLegateTo ldap属性中找到）的任何用户身份验证。也就是说，具有此权限的节点可以将目标主机特定服务的任何域主（包括域名）模仿。一个警告的用户不能在“受保护的用户”安全组中，或者以其他方式撤销了委派特权。在受约束的授权中存在一个问题，在这种约束授权中，所得票证的服务名称（SNAME）不是受保护的票证信息的一部分，这意味着攻击者可以将目标服务名称修改为所选择的任何服务。例如，如果msds-allowedtodelegateto是“ http/host.domain.com”，则可以为LDAP/host/等修改门票。服务名称，导致完整的服务器妥协，无论列出的特定服务如何。",
    "CoerceToTGT": "The  controlled object is configured with Kerberos unconstrained delegation.Users and computers authenticating against controlled object will have their Kerberos TGT sent to controlled object, unless they are marked as sensitive or members of Protected Users.An attacker with control over controlled object can coerce a Tier Zero computer (e.g. DC) to authenticate against controlled object and obtain the target's TGT. With the TGT of a DC, the attacker can perform DCSync to compromise the domain. Alternatively, the TGT can be used to obtain admin access to the target host with a shadow credentials + silver ticket attack or a resource-based constrained delegation attack.\n\n受控的对象配置为Kerberos无限制的委托。使用对象进行对象进行认证的用户和计算机将其Kerberos TGT发送到受控对象，除非将其标记为敏感的对象或受保护用户的成员或受控对象的攻击者可以控制零计算机（例如DC），以验证对象并获得对象的目标，并获得了目标。使用DC的TGT，攻击者可以执行DCSYNC来妥协域。另外，TGT可用于获得具有影子凭据 +银票攻击或基于资源的约束委派攻击的目标主机的管理员访问。",
    "GetChanges": "This entity has the DS-Replication-Get-Changes permission on the domain target object.Individually, this edge does not grant the ability to perform an attack. However, in conjunction with DS-Replication-Get-Changes-All, a principal may perform a DCSync attack.\n\n该实体在域目标对象上具有DS-Replication-GET-GET-CHANGES许可。但是，与ds-replication-get-changes-all结合使用，本金可以执行DCSYNC攻击。",
    "GetChangesAll": "This entity has the DS-Replication-Get-Changes-All permission on the domain target object.Individually, this edge does not grant the ability to perform an attack. However, in conjunction with DS-Replication-Get-Changes, a principal may perform a DCSync attack.\n\n该实体在域目标对象上具有DS-复制范围的变更 - 所有权限。但是，与DS-复制式变更变更一起，本金可能会执行DCSYNC攻击。",
    "ReadLAPSPassword": "This entity has the ability to read the password set by Local Administrator Password Solution (LAPS) on the computer target object.For systems using legacy LAPS, the following AD computer object properties are relevant:\n- - ms-Mcs-AdmPwd: The plaintext LAPS password\n- - ms-Mcs-AdmPwdExpirationTime: The LAPS password expiration time\nFor systems using Windows LAPS (2023 edition), the following AD computer object properties are relevant:\n- - msLAPS-Password: The plaintext LAPS password\n- - msLAPS-PasswordExpirationTime: The LAPS password expiration time\n- - msLAPS-EncryptedPassword: The encrypted LAPS password\n- - msLAPS-EncryptedPasswordHistory: The encrypted LAPS password history\n- - msLAPS-EncryptedDSRMPassword: The encrypted Directory Services Restore Mode (DSRM) password\n- - msLAPS-EncryptedDSRMPasswordHistory: The encrypted DSRM password history\n\n\n该实体能够读取由本地管理员密码解决方案（laps）设置的密码。对于使用Legacy Laps的系统，以下AD计算机对象属性是相关的：\n-  MS-MCS-ADMPWD：明文圈密码\n-  MS-MCS-ADMPWDEXPIRATIONTIME：LAPS密码到期时间\n对于使用Windows圈（2023 Edition）的系统，以下AD计算机对象属性相关：\n-  mslaps -password：明文圈密码\n-  MSLAPS -PASSWORDEXPIRATIONTIME：LAPS密码到期时间\n-  mslaps-cancryptedPassword：加密圈密码\n-  mslaps-cryptedpasswordhistory：加密圈密码历史记录\n-  mslaps -canrypteddsrmpassword：加密目录服务还原模式（DSRM）密码\n-  mslaps -canrypteddsrmpasswordhistory：加密的DSRM密码历史记录",
    "Contains": " controlled object contains the  target object.\n\n受控对象包含目标对象。",
    "GPLink": "The GPO controlled object is linked to the  target object.A linked GPO applies its settings to objects in the linked container.\n\nGPO控制的对象链接到目标对象。A链接的GPO将其设置应用于链接容器中的对象。",
    "AddAllowedToAct": "This entity has can modify the msds-AllowedToActOnBehalfOfOtherIdentity attribute on the computer target object.The ability to modify the msDS-AllowedToActOnBehalfOfOtherIdentity property allows an attacker to abuse resource-based constrained delegation to compromise the remote computer system. This property is a binary DACL that controls what security principals can pretend to be any domain user to the particular computer object.If the msDS-AllowedToActOnBehalfOfOtherIdentity DACL is set to allow an attack-controller account, the attacker can use said account to execute a modified S4U2self/S4U2proxy abuse chain to impersonate any domain user to the target computer system and receive a valid service ticket \"as\" this user.One caveat is that impersonated users can not be in the \"Protected Users\" security group or otherwise have delegation privileges revoked. Another caveat is that the principal added to the msDS-AllowedToActOnBehalfOfOtherIdentity DACL *must* have a service principal name (SPN) set in order to successfully abuse the S4U2self/S4U2proxy process. If an attacker does not currently control an account with a SPN set, an attacker can abuse the default domain MachineAccountQuota settings to add a computer account that the attacker controls via the Powermad project.\n\n该实体可以修改计算机目标对象上的MSDS-howerDactOctonBehalfoFoFofoFoFoFoFoFoFoFoFoFoFoFoFoFofignity属性。修改MSDS-AllowDoactOctonBehalfoFofoFofofrofictionity属性的能力允许攻击者滥用基于资源的受限委托书以损害远程计算机系统。该属性是一个二进制DACL，它可以控制哪些安全主体可以假装是任何域用户。一个警告是，假名的用户不能在“受保护的用户”安全组中，或者以其他方式撤销了授权特权。另一个警告是，添加到MSDS-AllowDoctonBehalfoFofoFoFofoFoFoFoFoFoFoFoFoFoFoFoFoFoFoFoFoFofignity DACL *必须 *具有服务主名称（SPN），以便成功滥用S4U2 self/s4u2proxy流程。如果攻击者当前没有使用SPN集控制帐户，则攻击者可以滥用默认域Machineaeaccountqountquonta设置，以添加攻击者通过PowerMad项目控制的计算机帐户。",
    "AllowedToAct": "This entity has is added to the msds-AllowedToActOnBehalfOfOtherIdentity attribute on the computer target object.An attacker can use this account to execute a modified S4U2self/S4U2proxy abuse chain to impersonate any domain user to the target computer system and receive a valid service ticket \"as\" this user.One caveat is that impersonated users can not be in the \"Protected Users\" security group or otherwise have delegation privileges revoked. Another caveat is that the principal added to the msDS-AllowedToActOnBehalfOfOtherIdentity DACL *must* have a service principal name (SPN) set in order to successfully abuse the S4U2self/S4U2proxy process. If an attacker does not currently control an account with a SPN set, an attacker can abuse the default domain MachineAccountQuota settings to add a computer account that the attacker controls via the Powermad project.\n\nThis entity has is added to the msds-AllowedToActOnBehalfOfOtherIdentity attribute on the computer target object.An attacker can use this account to execute a modified S4U2self/S4U2proxy abuse chain to impersonate any domain user to the target computer system and receive a valid service ticket \"as\" this user.One caveat is that impersonated users can not be in the \"Protected Users\" security group or otherwise have delegation privileges被撤销。另一个警告是，添加到MSDS-AllowDoctonBehalfoFofoFoFofoFoFoFoFoFoFoFoFoFoFoFoFoFoFoFoFoFofignity DACL *必须 *具有服务主名称（SPN），以便成功滥用S4U2 self/s4u2proxy流程。如果攻击者当前没有使用SPN集控制帐户，则攻击者可以滥用默认域Machineaeaccountqountquonta设置，以添加攻击者通过PowerMad项目控制的计算机帐户。",
    "SQLAdmin": "The user controlled object is a SQL admin on the computer target object.There is at least one MSSQL instance running on target object where the user controlled object is the account configured to run the SQL Server instance. The typical configuration for MSSQL is to have the local Windows account or Active Directory domain account that is configured to run the SQL Server service (the primary database engine for SQL Server) have sysadmin privileges in the SQL Server application. As a result, the SQL Server service account can be used to log into the SQL Server instance remotely, read all of the databases (including those protected with transparent encryption), and run operating systems command through SQL Server (as the service account) using a variety of techniques.For Windows systems that have been joined to an Active Directory domain, the SQL Server instances and the associated service account can be identified by executing a LDAP query for a list of \"MSSQLSvc\" Service Principal Names (SPN) as a domain user. In short, when the Database Engine service starts, it attempts to register the SPN, and the SPN is then used to help facilitate Kerberos authentication.Author: Scott Sutherland\n\n用户控制的对象是计算机目标对象上的SQL管理员。在目标对象上至少有一个MSSQL实例，其中用户控制的对象是配置为运行SQL Server实例的帐户。MSSQL的典型配置是具有配置为运行SQL Server服务（SQL Server的主要数据库引擎）的本地Windows帐户或Active Directory Domain帐户。As a result, the SQL Server service account can be used to log into the SQL Server instance remotely, read all of the databases (including those protected with transparent encryption), and run operating systems command through SQL Server (as the service account) using a variety of techniques.For Windows systems that have been joined to an Active Directory domain, the SQL Server instances and the associated service account can be identified by executing a LDAP query for a list of“ MSSQLSVC”服务主名（SPN）作为域用户。简而言之，当数据库引擎服务启动时，它将尝试注册SPN，然后使用SPN来帮助促进Kerberos的身份验证。作者：Scott Sutherland",
    "ReadGMSAPassword": "target object is a Group Managed Service Account. The  controlled object can retrieve the password for the GMSA target object.Group Managed Service Accounts are a special type of Active Directory object, where the password for that object is mananaged by and automatically changed by Domain Controllers on a set interval (check the MSDS-ManagedPasswordInterval attribute).The intended use of a GMSA is to allow certain computer accounts to retrieve the password for the GMSA, then run local services as the GMSA. An attacker with control of an authorized principal may abuse that privilege to impersonate the GMSA.\n\n目标对象是组托管服务帐户。受控的对象可以检索GMSA目标对象的密码。组托管的服务帐户是一种特殊类型的Active Directory对象，该对象是该对象的一种特殊类型，该对象的密码由域控制器在设置的间隔上进行操作并自动更改（检查MSDS-MENAGGEDPASSWORPWORSWORDWORDVALDWORDVAL VAL属性。控制授权委托人的攻击者可能会滥用那种假冒GMSA的特权。",
    "HasSIDHistory": "The  controlled object has, in its SIDHistory attribute, the SID for the  target object.When a kerberos ticket is created for controlled object, it will include the SID for target object, and therefore grantcontrolled object the same privileges and permissions astarget object.\n\n受控对象在其Sidhistory属性中具有目标对象的SID。为受控对象创建Kerberos票证时，它将包括目标对象的SID，因此将授予对象具有相同的特权和权限Astarget对象。",
    "CrossForestTrust": "The CrossForestTrust edge represents a cross-forest (interforest) trust relationship between two domains/forests. In this relationship, the controlled object domain has a cross-forest trust to the target object domain, allowing principals (users and computers) from target object to access resources in controlled object.Trust Edge PropertiesBloodHound stores the following properties for CrossForestTrust edges (listed under Relationship Information):- Spoof SID History Blocked\nAn attacker with control over the trusted domain may attempt to escalate privileges in the trusting domain using a spoof SID history attack by injecting the SID of a privileged principal from the trusting domain into their authentication request. However, this attack can be prevented by SID filtering.SID filtering removes domain SIDs from authentication requests of foreign principals based on the trust configuration. Built-in SIDs (S-1-5-32-*) are always filtered, regardless of the configuration. For cross-forest trusts, blocking spoof SID history attacks requires filtering out SIDs that do not belong to the forest of the trusted domain.Cross-forest trusts blocks spoof SID history attacks by default. Forest trusts filter out SIDs that do not belong to the forest of the trusted domain. However, SID filtering for forest trusts can be relaxed by enabling the trustAttributes flag TREAT_AS_EXTERNAL. When enabled, SID filtering behaves like it does for external trusts (without quarantine mode), meaning only SIDs with a RID below 1000 (built-in AD principals) are filtered, allowing a potential spoof SID history attack.External trusts have quarantine mode (trustAttributes flag QUARANTINED_DOMAIN) enabled by default, protecting the trusting domain by filtering out SIDs that do not belong to the trusted domain in authentication requests. An external trust with quarantine mode disabled does not block spoof SID history attacks.SID filtering is managed from the outbound side of the trust. As a result, this property is only created if trust data from the outbound side has been ingested.- TGT Delegation\nTGT delegation determines whether unconstrained delegation is allowed over the trust. When a principal from the trusted domain authenticates against a Kerberos resource with unconstrained delegation in the trusting domain, their Kerberos TGT (Ticket Granting Ticket) is forwarded to the resource as part of Kerberos authentication, but only if TGT delegation is enabled (true).By default, TGT delegation is disabled for cross-forest trusts. It is enabled if the trustAttributes flag CROSS_ORGANIZATION_ENABLE_TGT_DELEGATION is enabled for the trust and quarantine mode (trustAttributes flag QUARANTINED_DOMAIN) is NOT enabled.TGT delegation is controlled from the inbound side of the trust, and the property is therefore only created if trust data from this side has been ingested.- Transitive\nTransitivity defines whether the trust extends beyond the two domains involved. A transitive trust allows access not only to principals of the trusted domain but also to those from other domains trusted by the trusted domain.Forest trusts are always transitive, external trusts are non-transitive.Attackers can bypass the limitations of non-transitive trusts by manually requesting local Kerberos TGTs for each domain in the trust chain. They can then use these local TGTs to access Kerberos resources that would otherwise be denied if requested directly. For more details, refer to \"External trusts are evil\" under References.- Trust Attributes\nThis property stores the raw value of the trustAttributes LDAP attribute, which defines the trust's configuration settings. BloodHound retains this property from both the outbound and inbound sides of the trust, as they may differ.- Trust Type\nThe trust type for cross-forest trusts can be Forest, External, Kerberos (Realm), or Unknown. Refer to the \"Microsoft AD Trust Technical Documentation\" under References for more details.\n\n横福斯塔斯特（Crossforesttrust）边缘代表了两个领域/森林之间的跨森林（高线）信任关系。在这种关系中，受控的对象域对目标对象域具有横陆信任，允许校长（用户和计算机）从目标对象访问受控对象中的资源。trustedge propertiesbloodhound商店的以下属性，用于交叉for虫边缘的属性（在关系中列出）\n控制受信任域的攻击者可能会尝试通过将信任委托人从信任域中注入特权委托人的SID来升级信任域中的特权。但是，可以通过SID过滤来防止这种攻击。SID过滤根据信任配置从外国主体的身份验证请求中删除域SID。内置的SIDS（S-1-5-32-*）总是被过滤，无论配置如何。对于越野信托，阻止欺骗SID历史记录攻击需要滤除不属于可信赖域名的森林。Cross-Forest Trusts默认情况下阻止Spoof SID历史记录攻击。森林信任过滤掉不属于可信赖领域的森林的小溪。但是，可以通过启用TrustAttributes flag treat_as_external来放松森林信托的SID过滤。When enabled, SID filtering behaves like it does for external trusts (without quarantine mode), meaning only SIDs with a RID below 1000 (built-in AD principals) are filtered, allowing a potential spoof SID history attack.External trusts have quarantine mode (trustAttributes flag QUARANTINED_DOMAIN) enabled by default, protecting the trusting domain by filtering out SIDs that do not belong to the trusted domain in authentication请求。禁用隔离模式的外部信任不会阻止Spoof SID历史记录攻击。SID过滤是从信任的出站侧管理的。结果，仅在摄入了来自出站方面的信任数据时才创建此属性。-TGT委托\nTGT代表团确定是否允许对信托的无约束委派。当受信任领域的校长对信任领域中无限制代表团的Kerberos资源进行身份验证时，他们的Kerberos TGT（票证授予票）被转发到该资源作为Kerberos身份验证的一部分，但仅当启用TGT授权（true）的TGT代表。如果信任和隔离模式（trustattributes far parrantined_domain）启用了启用信任和隔离模式的trainttributes flag cross_organization_enable_tgt_delegation，则启用它。\n传递性定义了信任是否超出了所涉及的两个领域。传递信任不仅允许访问受信任域信任的其他域的原理，还允许访问来自受信任域的其他域的原理。信任始终是传递性的，外部信任是非传播的。攻击者可以通过在信任链中为每个域的本地kerberos tgts手动索取本地kerberos tgts的限制。然后，他们可以使用这些本地TGT访问Kerberos资源，如果直接要求，否则将被拒绝。有关更多详细信息，请参阅参考文献中的“外部信任是邪恶的”。-信任属性\n该属性存储TrustAttributes LDAP属性的原始值，该属性定义了信任的配置设置。BloodHound从信托的出站和入站方面保留了这一财产，因为它们可能会有所不同。-信托类型\n跨森林信托的信任类型可以是森林，外部，kerberos（领域）或未知。有关更多详细信息，请参阅参考文献中的“ Microsoft AD Trust技术文档”。",
    "SameForestTrust": "The SameForestTrust edge represents a same-forest (intraforest) trust relationship between two domains within the same AD forest. In this relationship, the controlled object domain has a same-forest trust with the target object domain, allowing principals (users and computers) from target object to access resources in controlled object.Since both domains belong to the same forest, they inherently trust each other, granting implicit access to resources across domains. It also means compromising one of the domains enable compromise of the other.Trust Edge PropertiesBloodHound stores the following properties for SameForestTrust edges (listed under Relationship Information):- Spoof SID History Blocked\nAn attacker with control over the trusted domain may attempt to escalate privileges in the trusting domain using a spoof SID history attack by injecting the SID of a privileged principal from the trusting domain into their authentication request. However, this attack can be prevented by SID filtering.SID filtering removes domain SIDs from authentication requests of foreign principals based on the trust configuration. Built-in SIDs (S-1-5-32-*) are always filtered, regardless of the configuration. SID filtering blocks the spoof SID history attack over same-forest trusts when the trust is configured in quarantine mode (trustAttributes flag QUARANTINED_DOMAIN enabled), which filters out SIDs that do not belong to the trusted domain. Same-forest trusts does not have quarantine mode enabled by default.SID filtering is managed from the outbound side of the trust, and the \"Spoof SID History Blocked\" property is therefore only created if trust data from this side has been ingested.- TGT Delegation\nTGT delegation determines whether unconstrained delegation is allowed over the trust. When a principal from the trusted domain authenticates against a Kerberos resource with unconstrained delegation in the trusting domain, their Kerberos TGT (Ticket Granting Ticket) is forwarded to the resource as part of Kerberos authentication, but only if TGT delegation is enabled (true).By default, TGT delegation is enabled for same-forest trusts. It is disabled if quarantine mode (trustAttributes flag QUARANTINED_DOMAIN) is enabled.TGT delegation is controlled from the inbound side of the trust, and the property is therefore only created if trust data from this side has been ingested.- Transitive\nTransitivity defines whether the trust extends beyond the two domains involved. A transitive trust allows access not only to principals of the trusted domain but also to those from other domains trusted by the trusted domain.\n\nSame-forest trusts are always transitive.- Trust Attributes\nThis property stores the raw value of the trustAttributes LDAP attribute, which defines the trust's configuration settings. BloodHound retains this property from both the outbound and inbound sides of the trust, as they may differ.- Trust Type\nThe trust type for same-forest trusts can be TreeRoot, ParentChild, or CrossLink (Shortcut). Refer to the \"Microsoft AD Trust Technical Documentation\" under References for more details.\n\n相同的Foresttrust边缘代表了同一广告林中两个领域之间的相同森林（前处内）信任关系。在这种关系中，受控的对象域与目标对象域具有相同的信任，从目标对象允许校长（用户和计算机）访问受控对象中的资源。由于两个域都属于同一森林，他们固有地相互信任，并授予对跨域中资源的隐式访问。这也意味着妥协的一个域之一使另一个领域妥协。trustEdgepropertiesBloodhound存储以下sameforesttrust边缘的属性（在关系信息下列出）： - 欺骗SID历史记录已阻止\n控制受信任域的攻击者可能会尝试通过将信任委托人从信任域中注入特权委托人的SID来升级信任域中的特权。但是，可以通过SID过滤来防止这种攻击。SID过滤根据信任配置从外国主体的身份验证请求中删除域SID。内置的SIDS（S-1-5-32-*）总是被过滤，无论配置如何。当信任以隔离模式配置时，SID滤波会阻止同一for trust的欺骗记录攻击（启用了信任flag parrantined_domain），该信任启用了不属于受信任域的SIDS。默认情况下，同一福雷斯特信托没有启用隔离模式。从信托的出站方面管理SID过滤，因此仅在摄入了来自此方面的信任数据的情况下才创建“欺骗SID历史记录”属性。\nTGT代表团确定是否允许对信托的无约束委派。当受信任领域的校长对信任领域中无限制代表团的Kerberos资源进行身份验证时，他们的Kerberos TGT（票证授予票）被转发到该资源作为Kerberos身份验证的一部分，但仅当启用TGT代表（true）default，TGT，TGT委托委托人授予同一委托人。如果启用了隔离模式（TrustAttributes Flag parrantined_domain），则它将被禁用。TGT委托由信托的入站侧控制，因此仅在摄入该侧面的信任数据时才创建属性。\n传递性定义了信任是否超出了所涉及的两个领域。传递信任不仅允许访问受信任域的其他域的原理，还允许访问受信任域信任的其他域的原理。\n\n同一林信托始终是传递的。-信任属性\n该属性存储TrustAttributes LDAP属性的原始值，该属性定义了信任的配置设置。BloodHound从信托的出站和入站方面保留了这一财产，因为它们可能会有所不同。-信托类型\n同一信任的信任类型可以是Treeroot，parentchild或crosslink（快捷方式）。有关更多详细信息，请参阅参考文献中的“ Microsoft AD Trust技术文档”。",
    "SpoofSIDHistory": "The cross-forest trust from target object to controlled object has a weak SID filtering configuration (Spoof SID History Blocked = False).The target object domain allows principals of controlled object access by SIDs of target object in their SID history. An attacker with control over the controlled object domain can craft access requests with manipulated SID history containing SIDs of privileged principals of target object to gain control over the target object domain.\n\n从目标对象到受控对象的跨索信托具有弱的SID过滤配置（Spoof SID历史记录阻止= false）。目标对象域允许目标对象在其SID历史记录中通过目标对象的SIDS访问的主体访问原理。具有控制受控对象域的攻击者可以使用操纵的SID历史记录来制作访问请求，其中包含目标对象特权主体的SID，以获得对目标对象域的控制。",
    "AbuseTGTDelegation": "The cross-forest trust from target object to controlled object has TGT delegation enabled.When a resource in controlled object is configured with unconstrained delegation, principals from target object will automatically forward their Ticket Granting Ticket (TGT) to that resource upon access.\n\n从目标对象到受控对象的跨索信托已启用了TGT委托。当受控对象中的资源配置为无约束的委托，目标对象的原理将自动将其票证授予票证（TGT）自动转发到访问后的资源。",
    "CanPSRemote": "This entity has the capability to create a PSRemote Connection with the computer target object.PS Session access allows you to enter an interactive session with the target computer. If authenticating as a low privilege user, a privilege escalation may allow you to gain high privileges on the system.Note: This edge does not guarantee privileged execution.\n\n该实体有能力与计算机目标对象创建PSREMOTE连接。PS会话访问使您可以与目标计算机输入交互式会话。如果以低特权用户身份进行身份验证，则特权升级可能使您可以在系统上获得高特权。注意：此优势不能保证特权执行。",
    "AZAddMembers": "The ability to add other principals to an Azure security group\n\n将其他校长添加到Azure安全组的能力",
    "AZAddSecret": "Azure provides several systems and mechanisms for granting control of securable objects within Azure Active Directory, including tenant-scoped admin roles, object-scoped admin roles, explicit object ownership, and API permissions.When a principal has been granted \"Cloud App Admin\" or \"App Admin\" against the tenant, that principal gains the ability to add new secrets to all Service Principals and App Registrations. Additionally, a principal that has been granted \"Cloud App Admin\" or \"App Admin\" against, or explicit ownership of a Service Principal or App Registration gains the ability to add secrets to that particular object.\n\nAzure提供了几种系统和机制，用于授予Azure Active Directory中可靠的对象的控制，包括租户划分的管理角色，对象分割的管理员角色，明确的对象所有权和API权限。当委托人被授予“云应用程序”或“应用程序App Admin”或“ App Admin”的范围，以供租户增加新的秘密秘密服务，以添加新的秘密规定。此外，已被授予“云应用程序管理”或“应用程序管理员”的本金，反对服务主或应用程序注册的明确所有权，可获得向该特定对象添加秘密的能力。",
    "AZAvereContributor": "Any principal granted the Avere Contributor role, scoped to the affected VM, can reset the built-in administrator password on the VM.\n\n任何授予Avere贡献者角色的校长范围为受影响的VM，都可以重置VM上的内置管理员密码。",
    "AZContains": "This indicates that the parent object contains the child object, such as a resource group containing a virtual machine, or a tenant \"containing\" a subscription.\n\n这表明父对象包含子对象，例如包含虚拟机的资源组，或“包含”订阅的房客。",
    "AZContributor": "The contributor role grants almost all abusable privileges in all circumstances, with some exceptions. Those exceptions are not collected by AzureHound.\n\n除某些情况外，该贡献者的角色几乎授予所有可滥用的特权。这些例外不是由Azurehound收集的。",
    "AZExecuteCommand": "Principals with the Intune Administrators role are able to execute arbitrary PowerShell scripts on devices that are joined to the Azure Active Directory tenant.\n\n具有Intune Administrator角色的主体能够在连接到Azure Active Directory租户的设备上执行任意PowerShell脚本。",
    "AZGetCertificates": "The ability to read certificates from key vaults\n\n从钥匙库中读取证书的能力",
    "AZGetKeys": "The ability to read keys from key vaults\n\n从钥匙库中读取键的能力",
    "AZGetSecrets": "The ability to read secrets from key vaults\n\n从关键保险库中读取秘密的能力",
    "AZHasRole": "This edge indicates that a principal has been granted a particular AzureAD admin role.\n\n该边缘表明本金已被授予特定的Azuread管理员角色。",
    "AZManagedIdentity": "Azure resources like Virtual Machines, Logic Apps, and Automation Accounts can be assigned to either System- or User-Assigned Managed Identities. This assignment allows the Azure resource to authenticate to Azure services as the Managed Identity without needing to know the credential for that Managed Identity. Managed Identities, whether System- or User-Assigned, are AzureAD Service Principals.\n\n诸如虚拟机，逻辑应用程序和自动化帐户之类的Azure资源可以分配给系统或用户分配的托管身份。该分配使Azure资源可以将Azure服务作为托管身份进行身份验证，而无需了解该托管身份的凭据。托管身份，无论是系统或用户分配的，都是Azuread服务原理。",
    "AZMemberOf": "The  controlled object is a member of the group target object.Groups in Azure Active Directory grant their direct members any privileges the group itself has. If a group has an AzureAD admin role, direct members of the group inherit those permissions.\n\n受控对象是组目标对象的成员。Azure Active Directory中的组批准了该组本身的任何特权。如果一个组具有Azuread管理员角色，则该组的成员将继承这些权限。",
    "AZOwns": "Object ownership means almost all abuses are possible against the target object.\n\n对象所有权意味着几乎所有滥用都可以针对目标对象。",
    "AZPrivilegedAuthAdmin": "This edge indicates the principal has the Privileged Authentication Administrator role active against the target tenant. Principals with this role can update sensitive properties for all users. Privileged Authentication Administrator can set or reset any authentication method (including passwords) for any user, including Global Administrators.\n\n该边缘表明本金具有特权身份验证管理员对目标租户的角色。具有此角色的主体可以为所有用户更新敏感属性。特权身份验证管理员可以为任何用户（包括全局管理员）设置或重置任何身份验证方法（包括密码）。",
    "AZPrivilegedRoleAdmin": "The Privileged Role Admin role can grant any other admin role to another principal at the tenant level.\n\n特权角色管理员角色可以在租户级别授予其他委托人的任何其他行政角色。",
    "AZResetPassword": "The ability to change another user's password without knowing their current password\n\n在不知道当前密码的情况下更改另一个用户密码的能力",
    "AZUserAccessAdministrator": "The User Access Administrator role can manage user access to Azure resources, assign roles in Azure RBAC, and assign the Owner role to themselves or others.\n\n用户访问管理员角色可以管理用户对Azure资源的访问，在Azure RBAC中分配角色，并将所有者角色分配给自己或他人。",
    "AZGlobalAdmin": "This edge indicates the principal has the Global Admin role active against the target tenant. In other words, the principal is a Global Admin. Global Admins can do almost anything against almost every object type in the tenant, this is the highest privilege role in Azure.\n\n该边缘表明本金具有针对目标租户的全球管理员角色。换句话说，本金是全球管理员。全球管理员几乎可以对租户中几乎每种对象类型做任何事情，这是Azure中最高特权的角色。",
    "AZAppAdmin": "Principals with the Application Admin role can control tenant-resident apps.\n\n具有申请管理角色的校长可以控制租户居民应用程序。",
    "AZCloudAppAdmin": "Principals with the Cloud App Admin role can control tenant-resident apps\n\n具有云应用管理员角色的校长可以控制租户居民应用程序",
    "AZRunsAs": "The Azure App runs as the Service Principal when it needs to authenticate to the tenant\n\n当需要向房客身份验证时，Azure应用程序作为服务主体运行",
    "AZVMAdminLogin": "When a virtual machine is configured to allow logon with Azure AD credentials, the VM automatically has certain principals added to its local administrators group, including any principal granted the Virtual Machine Administrator Login (or \"VMAL\") admin role.Any principal granted this role, scoped to the affected VM, can connect to the VM via RDP and will be granted local admin rights on the VM.\n\n当将虚拟机配置为允许具有Azure Ad凭据的登录量时，VM会自动将某些主体添加到其本地管理员组中，包括任何授予虚拟机管理员登录（或“ VMAL”）管理员角色的主体。任何授予该角色的主管，均可以通过RDP连接到VM的范围内，并将在RDP上连接到vm and vm and Inded Indect vm ned vm ned vm eved eved eved vm eved。",
    "AZVMContributor": "The Virtual Machine contributor role grants almost all abusable privileges against Virtual Machines.\n\n虚拟机贡献者的角色几乎授予对虚拟机的所有滥用特权。",
    "WriteSPN": "This entity has the ability to write to the \"serviceprincipalname\" attribute to the  target object.\n\n该实体具有写入目标对象的“ ServicePrincipalname”属性的能力。",
    "AddSelf": "This entity has the ability to add itself, to the group target object. Because of security group delegation, the members of a security group have the same privileges as that group.By adding itself to the group, controlled object will gain the same privileges that target object already has.\n\n该实体具有将自身添加到组目标对象的能力。由于安全组委派，安全组的成员具有与该组相同的特权。通过将自己添加到组中，受控对象将获得与目标对象已经具有的相同特权。",
    "AddKeyCredentialLink": "This entity has the ability to write to the \"msds-KeyCredentialLink\" property on target object. Writing to this property allows an attacker to create \"Shadow Credentials\" on the object and authenticate as the principal using kerberos PKINIT.\n\n该实体能够在目标对象上写入“ MSDS-keycredentialLink”属性。写入此属性使攻击者可以在对象上创建“影子凭据”，并使用Kerberos Pkinit进行身份验证。",
    "DCSync": "This entity has the DS-Replication-Get-Changes and the DS-Replication-Get-Changes-All permission on the domain target object.These two permissions allow a principal to perform a DCSync attack.\n\n该实体在域目标对象上具有DS-复制 -  GET-CHANGES和DS-REPLICATION-GET-CHANGES-CHANGES-CHANGES-CHANGES-ALL许可。这两个权限允许主体执行DCSYNC攻击。",
    "SyncLAPSPassword": "This entity has the ability to synchronize the password set by Local Administrator Password Solution (LAPS) on the computer target object.The local administrator password for a computer managed by LAPS is stored in the confidential and Read-Only Domain Controller (RODC) filtered LDAP attribute \n```sh\nms-mcs-AdmPwd\n```.\n\n该实体具有在计算机目标对象上通过本地管理员密码解决方案（LAPS）设置的密码的能力。由LAPS管理的计算机的本地管理员密码存储在机密和读取的唯一域控制器（RODC）过滤的LDAP属性中\n````sh\nMS-MCS-ADMPWD\n````````。",
    "WriteAccountRestrictions": "This entity has has write rights on all properties in the User Account Restrictions property set. Having write access to this property set translates to the ability to modify several attributes on computer target object, among which the msDS-AllowedToActOnBehalfOfOtherIdentity attribute is the most interesting. The other attributes in this set are listed in Dirk-jan's blog on this topic (see references).The ability to modify the msDS-AllowedToActOnBehalfOfOtherIdentity property allows an attacker to abuse resource-based constrained delegation to compromise the remote computer system. This property is a binary DACL that controls what security principals can pretend to be any domain user to the particular computer object.If the msDS-AllowedToActOnBehalfOfOtherIdentity DACL is set to allow an attack-controller account, the attacker can use said account to execute a modified S4U2self/S4U2proxy abuse chain to impersonate any domain user to the target computer system and receive a valid service ticket \"as\" this user.One caveat is that impersonated users can not be in the \"Protected Users\" security group or otherwise have delegation privileges revoked. Another caveat is that the principal added to the msDS-AllowedToActOnBehalfOfOtherIdentity DACL *must* have a service principal name (SPN) set in order to successfully abuse the S4U2self/S4U2proxy process. If an attacker does not currently control an account with a SPN set, an attacker can abuse the default domain MachineAccountQuota settings to add a computer account that the attacker controls via the Powermad project.\n\n该实体具有对用户帐户限制属性集中所有属性的写入权。在对该属性集的写入访问后，可以转化为在计算机目标对象上修改多个属性的能力，其中MSD-AllowDoctOctonBehalfoFofoFofofroFofrofentity属性是最有趣的。此集合中的其他属性在Dirk-Jan的博客中列出了有关此主题的博客（请参阅参考）。修改MSDS-AllowDoctoCtaconBehalfoFofofrofofrofofrofrofentity属性的能力允许攻击者滥用基于资源的约束授权以损害远程计算机系统。该属性是一个二进制DACL，它可以控制哪些安全主体可以假装是任何域用户。一个警告是，假名的用户不能在“受保护的用户”安全组中，或者以其他方式撤销了授权特权。另一个警告是，添加到MSDS-AllowDoctonBehalfoFofoFoFofoFoFoFoFoFoFoFoFoFoFoFoFoFoFoFoFoFofignity DACL *必须 *具有服务主名称（SPN），以便成功滥用S4U2 self/s4u2proxy流程。如果攻击者当前没有使用SPN集控制帐户，则攻击者可以滥用默认域Machineaeaccountqountquonta设置，以添加攻击者通过PowerMad项目控制的计算机帐户。",
    "WriteGPLink": "This entity has has the permissions to modify the gPLink attribute of  target object.The ability to alter the gPLink attribute may allow an attacker to apply a malicious Group Policy Object (GPO) to all child user and computer objects (including the ones located in nested OUs). This can be exploited to make said child objects execute arbitrary commands through an immediate scheduled task, thus compromising them.Successful exploitation will require the possibility to add non-existing DNS records to the domain and to create machine accounts. Alternatively, an already compromised domain-joined machine may be used to perform the attack. Note that the attack vector implementation is not trivial and will require some setup.Alternatively, the ability to modify the gPLink attribute can be exploited in conjunction with write permissions on a GPO. In such a situation, an attacker could first inject a malicious scheduled task in the controlled GPO, and then link the GPO to the target through its gPLink attribute, making all child users and computers apply the malicious GPO and execute arbitrary commands.\n\n该实体具有修改目标对象的GPLINK属性的权限。更改GPLINK属性的能力可以使攻击者可以将恶意组策略对象（GPO）应用于所有子用户和计算机对象（包括位于嵌套OUS中的对象）。可以利用这使所说的子对象通过立即计划的任务执行任意命令，从而损害它们。成功的利用将需要有可能将不存在的DNS记录添加到域中并创建机器帐户。或者，可以使用已经折衷的域加入机器来执行攻击。请注意，攻击矢量实现并不是微不足道的，并且需要一些设置。在线，可以通过GPO上的写入权限来修改GPLINK属性的能力。在这种情况下，攻击者可以首先在受控的GPO中注入恶意计划的任务，然后通过其GPLINK属性将GPO链接到目标，从而使所有儿童用户和计算机都应用恶意GPO并执行任意命令。",
    "DumpSMSAPassword": "This entity has the Standalone Managed Service Account (sMSA) target object installed on it.With administrative privileges on controlled object, it is possible to dump target object's password stored in LSA secrets.\n\n该实体在其上安装了独立的托管服务帐户（SMSA）目标对象。在受控对象上进行管理特权，可以将存储在LSA Secrets中的目标对象转储目标对象。",
    "AZMGAddMember": "This edge is created during post-processing. It is created against non role assignable Azure AD security groups when a Service Principal has one of the following MS Graph app role assignments:Directory.ReadWrite.AllGroup.ReadWrite.AllGroupMember.ReadWrite.AllIt is created against all Azure AD security groups, including those that are role assignable, when a Service Principal has the following MS Graph app role:RoleManagement.ReadWrite.DirectoryYou will not see this privilege when using just the Azure portal or any other Microsoft tooling. If you audit the roles and administrators affecting any particular Azure security group, you will not see that the Service Principal can add members to the group, but it indeed can because of the parallel access management system used by MS Graph.\n\n该边缘是在后处理过程中创建的。It is created against non role assignable Azure AD security groups when a Service Principal has one of the following MS Graph app role assignments:Directory.ReadWrite.AllGroup.ReadWrite.AllGroupMember.ReadWrite.AllIt is created against all Azure AD security groups, including those that are role assignable, when a Service Principal has the following MS Graph app role:RoleManagement.ReadWrite.DirectoryYou will not see this privilege when using just theAzure门户或任何其他Microsoft工具。如果您审核影响任何特定Azure安全组的角色和管理员，您将看不到服务主体可以将成员添加到组中，但是确实可以是因为MS Graph使用的并行访问管理系统。",
    "AZMGAddOwner": "This edge is created during post-processing. It is created against all App Registrations and Service Principals within the same tenant when a Service Principal has the following MS Graph app role:Application.ReadWrite.AllIt is also created against all Azure Service Principals when a Service Principal has the following MS Graph app role:ServicePrincipalEndpoint.ReadWrite.AllIt is also created against all Azure security groups that are not role eligible when a Service Principal has one of the following MS Graph app roles:Directory.ReadWrite.AllGroup.ReadWrite.AllFinally, it is created against all Azure security groups and all Azure App Registrations when a Service Principal has the following MS Graph app role:RoleManagement.ReadWrite.DirectoryYou will not see these privileges when auditing permissions against any of the mentioned objects when you use Microsoft tooling, including the Azure portal and the MS Graph API itself.\n\n该边缘是在后处理过程中创建的。当服务主体具有以下MS Graph App角色时，它是针对同一租户内的所有应用程序注册和服务主体创建的：application.ReadWrite.Allit也会针对所有Azure Service主体创建服务主体具有以下MS Graph App app角色：ServicePrinCipAlendPoint.ReadWrite.AllIt。Allit也不是AlliT在所有Azure Security Appl中创建的一个azure Secival Graph a以下一个emak the Service M.角色：Directory.ReadWrite.AllGroup.ReadWrite.AllFine，它是针对所有Azure安全组和所有Azure App注册而创建的。",
    "AZMGAddSecret": "This edge is created during post-processing. It is created against all Azure App Registrations and Service Principals when a Service Principal has one of the following MS Graph app roles:Application.ReadWrite.AllRoleManagement.ReadWrite.DirectoryYou will not see this privilege when using just the Azure portal or any other Microsoft tooling. If you audit the roles and administrators affecting any particular Azure App or Service Principal, you will not see that the Service Principal can add secrets to the object, but it indeed can because of the parallel access management system used by MS Graph.\n\n该边缘是在后处理过程中创建的。当服务主体具有以下MS Graph App角色之一时，它是针对所有Azure App注册和服务主体创建的：application.ReadWrite.AllRoLemanagement.ReadWrite.DirectoryYou，当仅使用Azure Portal或任何其他Microsoft工具时，都不会看到此特权。如果您审核影响任何特定Azure应用程序或服务主体的角色和管理员，您将看不到服务主体可以向对象添加秘密，但是确实可以因为MS Graph使用的并行访问管理系统。",
    "AZMGGrantAppRoles": "This edge is created during post-processing. It is created against AzureAD tenant objects when a Service Principal has one of the following MS Graph app role assignments:AppRoleAssignment.ReadWrite.AllRoleManagement.ReadWrite.Directory\n\n该边缘是在后处理过程中创建的。当服务主体具有以下MS Graph App角色分配之一时，它是针对Azuread Tenant对象创建的：grapleAssignment.ReadWrite.AllroleManagement.ReadWrite.Directory",
    "AZMGGrantRole": "This edge is created during post-processing. It is created against all AzureAD admin roles when a Service Principal has the following MS Graph app role assignment:RoleManagement.ReadWrite.DirectoryThis privilege allows the Service Principal to promote itself or any other principal to any AzureAD admin role, including Global Administrator.\n\n该边缘是在后处理过程中创建的。当服务主体具有以下MS Graph App角色分配时，它是针对所有Azuread管理员角色而创建的：RoleManagement.ReadWrite.DirectoryThis Privilege允许服务原理提升自己或任何其他Azuread管理员角色，包括全球管理员，包括全球管理员。",
    "AZMGAppRoleAssignment_ReadWrite_All": "This edge is created when a Service Principal has been granted the AppRoleAssignment.ReadWrite.All edge. The edge is not abusable, but is used during post-processing to create abusable edges.\n\n当授予服务主体授予AmploAssignment.ReadWrite.All Edge时，创建此边缘。边缘不可滥用，但在后处理过程中用于创建可滥用的边缘。",
    "AZMGApplication_ReadWrite_All": "This edge is created when a Service Principal has been granted the Application.ReadWrite.All edge. The edge is not abusable, but is used during post-processing to create abusable edges.\n\n当已授予服务主体的应用程序。边缘不可滥用，但在后处理过程中用于创建可滥用的边缘。",
    "AZMGDirectory_ReadWrite_All": "This edge is created when a Service Principal has been granted the Directory.ReadWrite.All edge. The edge is not abusable, but is used during post-processing to create abusable edges.\n\n当授予服务主体目录。边缘不可滥用，但在后处理过程中用于创建可滥用的边缘。",
    "AZMGGroupMember_ReadWrite_All": "This edge is created when a Service Principal has been granted the GroupMember.ReadWrite.All edge. The edge is not abusable, but is used during post-processing to create abusable edges.\n\n当授予服务主体groupMember.ReadWrite.All Edge时，创建此边缘。边缘不可滥用，但在后处理过程中用于创建可滥用的边缘。",
    "AZMGGroup_ReadWrite_All": "This edge is created when a Service Principal has been granted the Group.ReadWrite.All edge. The edge is not abusable, but is used during post-processing to create abusable edges.\n\n当授予服务主体group.ReadWrite.All Edge时，创建此边缘。边缘不可滥用，但在后处理过程中用于创建可滥用的边缘。",
    "AZMGRoleManagement_ReadWrite_Directory": "This edge is created when a Service Principal has been granted the RoleManagement.ReadWrite.Directory edge. The edge is not abusable, but is used during post-processing to create abusable edges.\n\n当授予服务主体授予RoleManagement.ReadWrite.Directory Edge时，创建此边缘。边缘不可滥用，但在后处理过程中用于创建可滥用的边缘。",
    "AZMGServicePrincipalEndpoint_ReadWrite_All": "This edge is created when a Service Principal has been granted the ServicePrincipalEndpoint.ReadWrite.All edge. The edge is not abusable, but is used during post-processing to create abusable edges.\n\n当授予ServicePrinciPalendPoint.ReadWrite.All Edge时，创建此边缘。边缘不可滥用，但在后处理过程中用于创建可滥用的边缘。",
    "AZWebsiteContributor": "The Website Contributor role grants full control of the target Function App or Web App. Full control of either of those types of resources allows for arbitrary command execution against the target resoruce.\n\n网站贡献者角色可以完全控制目标功能应用程序或Web应用程序。完全控制这两种类型的资源，允许针对目标归因的任意命令执行。",
    "AZAddOwner": "This edge is created during post-processing. It is created against all App Registrations and Service Principals within the same tenant when an Azure principal has one of the following Azure Active Directory roles:Hybrid Identity AdministratorPartner Tier1 SupportPartner Tier2 SupportDirectory Synchronization AccountsYou will not see these privileges when auditing permissions against any of the mentioned objects when you use Microsoft tooling, including the Azure portal or any API.\n\n该边缘是在后处理过程中创建的。当Azure主管具有以下Azure Active Directory角色之一时，它是针对同一租户内的所有应用程序注册和服务主管创建的：混合身份管理器tier1 supporterPartner tier1 supportPartner tier2 supportDirectory synchronization accountsyou在使用Microsoft api（包括API）时，在审核范围时不会看到这些特权。",
    "AZAKSContributor": "The Azure Kubernetes Service Contributor role grants full control of the target Azure Kubernetes Service Managed Cluster. This includes the ability to remotely fetch administrator credentials for the cluster as well as the ability to execute arbitrary commands on compute nodes associated with the AKS Managed Cluster.\n\nAzure Kubernetes服务贡献者的角色可以完全控制目标Azure Kubernetes服务托管集群。这包括能够远程获取群集管理员凭据，以及在与AKS托管群集关联的计算节点上执行任意命令的能力。",
    "AZAutomationContributor": "The Azure Automation Contributor role grants full control of the target Azure Automation Account. This includes the ability to execute arbitrary commands on the Automation Account.\n\nAzure自动化贡献者角色可以完全控制目标Azure自动化帐户。这包括在自动化帐户上执行任意命令的能力。",
    "AZKeyVaultKVContributor": "The Key Vault Contributor role grants full control of the target Key Vault. This includes the ability to read all secrets stored on the Key Vault.\n\n钥匙库贡献者角色可以完全控制目标钥匙库。这包括读取存储在密钥库中的所有秘密的能力。",
    "AZLogicAppContributor": "The Logic Contributor role grants full control of the target Logic App. This includes the ability to execute arbitrary commands on the Logic App.\n\n逻辑贡献者角色授予目标逻辑应用程序的完全控制。这包括在逻辑应用程序上执行任意命令的能力。",
    "AZNodeResourceGroup": "This edge is created to link Azure Kubernetes Service Managed Clusters to the Virtual Machine Scale Sets they use to execute commands on.The system-assigned identity for the AKS Cluster will have the Contributor role against the target Resource Group and its child Virtual Machine Scale Sets.\n\n创建此边缘是为了将Azure Kubernetes服务托管簇链接到他们使用的虚拟机量表集。",
    "AZRoleApprover": "The Entra user is an approver for the role. If an account which can approve role assignments is compromised, an attacker could approve the assignment or activation of a role and escalate privileges in a tenant. The list of approvers is attached to a role policy and will be the designated principals for any approval requirements on the role. \n\nENTRA用户是该角色的批准。如果损害了可以批准角色分配的帐户，则攻击者可以批准角色的分配或激活，并在租户中升级特权。批准者名单附加到角色政策，并将成为有关该角色的任何批准要求的指定校长。",
    "AZRoleEligible": "The Entra user or group is eligible for a role assignment. If the user is compromised, an attacker could activate the role, or use a current activation to escalate privileges in the tenant.\n\nENTRA用户或组有资格获得角色分配。如果用户被妥协，攻击者可以激活角色，或使用当前激活来升级租户的特权。",
    "Enroll": "The  controlled object has enrollment rights against the target node, target object.The target node may be a Certificate Template or an Enterprise Certification Authority.\n\n受控对象具有针对目标节点，目标对象的注册权。目标节点可以是证书模板或企业认证机构。",
    "EnterpriseCAFor": "The  controlled object is an enterprise certification authority for target object.The Enterprise Certification Authority node is the enrollment service LDAP object for the target AIACA/Root Certification Authority node.\n\n受控对象是目标对象的企业认证机构。",
    "RootCAFor": "The  controlled object is the root certification authority for target object.The CA is trusted as a root certification authority by the domain. Any certificates signed by this CA will be trusted by the domain and all hosts in the domain.\n\n受控的对象是目标对象的根认证权限。CA被域被信任为根认证权限。该CA签署的任何证书将由域和域中的所有主机信任。",
    "PublishedTo": "The  controlled object is published to target object.The certificate template is published to an enterprise certification authority. This relationship means the certificate template can be used when submitting an enrollment request to the specified certification authority.\n\n受控对象已发布到目标对象。证书模板已发布给企业认证机构。这种关系意味着在向指定认证机构提交注册请求时可以使用证书模板。",
    "NTAuthStoreFor": "The NTAuthStore is the Enterprise NTAuth store (NTAuthCertificates object) for the the AD forest of the domain node. The NTAuthStore holds the list of certificates trusted for authentication in the AD forest of the domain target object. When a user attempts to authenticate against a domain with a certificate, a domain controller will verify that the certificate is signed by a certificate in the NTAuthStore.\n\nNtauthstore是域名域节点的AD森林的Enterprise ntauth商店（ntauthcertificatifificatififificates对象）。Ntauthstore列出了在域目标对象的AD森林中信任身份验证的证书列表。当用户尝试使用证书对域进行身份验证时，域控制器将验证证书是由NTAuthstore中的证书签名的。",
    "IssuedSignedBy": "The  controlled object's certificate is issued and signed by target objectWhen Windows assesses the validity and trustworthiness of a certificate it verifies the certificate chain up to a trusted root certificate. The IssuedSignedBy edge represent a link within the certificate chain.\n\n当Windows评估证书的有效性和可信赖性时，由目标对象签发并签署了受控对象的证书，并验证证书链的有效性和可信度。发行的签名边缘代表证书链中的链接。",
    "TrustedForNTAuth": "The NTAuthStore contains the certificate of the Enterprise CA, controlled object. The consequence of the relationship is that certificate issued by the Enterprise CA are trusted for authentication in the AD forest of the NTAuthStore.\n\nNTAuthstore包含企业CA的证书，即受控对象。关系的结果是，由企业CA签发的证书在Ntauthstore的AD森林中被信任进行身份验证。",
    "HostsCAService": "The  controlled object hosts the enrollment service for the enterprise CA target object.The Enterprise Certification Authority node is the enrollment service LDAP object for CA hosted on the computer node.\n\n受控对象托管企业CA目标对象的注册服务。企业认证机构节点是计算机节点上托管的CA的注册服务LDAP对象。",
    "DelegatedEnrollmentAgent": "The  controlled object is delegated the privilege to enroll certificates of the certificate template target object as an enrollment agent.The certificate template is published to an enterprise CA where the enrollment agent restrictions are configured to allow this principal to enroll certificates against this template as an enrollment agent. BloodHound does not assess what principals the enrollment agent is allowed to enroll on behalf of.\n\n将受控的对象委派给注册证书模板目标对象的证书作为注册代理。证书模板被公布到企业CA，其中注册代理限制被配置为允许该主体作为注册代理人针对此模板注册证书。BloodHound不评估允许入学代理人代表入学的校长。",
    "EnrollOnBehalfOf": "The  controlled object can be used to enroll certificates on behalf of other principals for the certificate template target object.The certificate template controlled object is configured to be used as an enrollment agent. The certificate template target object is configured to allow enrollment by enrollment agents. Both certificate templates are published by an enterprise CA which is trusted for NT authentication and chain up to a root CA for the domain. This enables a principal with a certificate of certificate template controlled object to enroll on behalf of other principals for certificate template target object as long as enrollment agent restrictions configured on the enterprise CA permit it.\n\n可控的对象可用于代表证书模板目标对象的其他主体注册证书。证书模板控制的对象被配置为用作注册代理。证书模板目标对象已配置为允许注册代理注册。这两个证书模板均由企业CA发布，该企业CA被信任，用于NT身份验证，并链接到该域的根CA。这样，只要在企业CA上配置的注册代理限制允许IT，就可以代表具有证书模板的证书模板证书的委托人代表其他委托人进行注册。",
    "GoldenCert": "The  controlled object has a certificate private key that can be abused to sign \"golden\" certificates for authentication of any enabled principal in the AD forest of domain target object.The  controlled object hosts the enrollment service of an enterprise CA which implies it has the private key of the enterprise CA's certificate. This private key allows an attacker to sign certificates for authentication as any enabled principal in the AD forest of domain target object, as the enterprise CA is trusted for NT authentication and chain up to a root CA.It may not be possible to obtain the certificate private key if it is protected with a Trusted Platform Module (TPM) or using a Hardware Security Module (HSM). However, it may still be possible to compromise the AD forest. Administrative access to the enterprise CA host lets an attacker publish certificate templates, approve denied enrollment requests, and more. The  controlled object will have an ESC7 edge to the domain target object if any such attack has been found possible by BloodHound.\n\n该受控对象具有一个证书的私钥，可以滥用以签署“金”证书，以在域目标对象的AD森林中对启用委托人进行身份验证。受控对象主持企业CA的注册服务，这意味着它具有企业CA的私钥。该专用密钥允许攻击者在域目标对象的AD森林中签名身份验证证书作为身份验证，因为企业CA被信任为NT身份验证，并链接到root CA。但是，仍然有可能破坏广告森林。对企业CA主机的行政访问允许攻击者发布证书模板，批准拒绝注册请求等等。如果血腥猎犬发现可能发生任何此类攻击，则受控对象将具有ESC7边缘的域目标对象。",
    "ADCSESC1": "This entity has the privileges to perform the ADCS ESC1 attack against the target domain.The principal has permission to enroll on one or more certificate templates, allowing them to specify an alternate subject name and use the certificate for authentication. They also have enrollment permission for an enterprise CA with the necessary templates published. This enterprise CA is trusted for NT authentication in the forest, along with the certificate chain up to the root CA certificate. This setup lets the principal enroll certificates for any AD forest user or computer, enabling authentication and impersonation of any AD forest user or computer without their credentials.\n\n该实体有特权对目标域进行ADCS ESC1攻击。本金有权注册一个或多个证书模板，从而允许他们指定替代主题名称并使用证书进行身份验证。他们还获得了企业CA的注册许可，并发表了必要的模板。该企业CA在森林中的NT身份验证以及root CA证书的证书链中被信任。此设置使任何AD森林用户或计算机的主要注册证书都可以在没有凭证的情况下对任何AD森林用户或计算机进行身份验证和模仿。",
    "ADCSESC4": "This entity has has the privileges to perform the ADCS ESC4 attack against the target domain.\n\nThe principal has permissions to modify the settings on one or more certificate templates, enabling the principal configure the certificate templates for ADCS ESC1 conditions, which allows them to specify an alternate subject name and use the certificate for authentication. They also has enrollment permission for an enterprise CA with the necessary templates published. This enterprise CA is trusted for NT authentication and chains up to a root CA for the forest. This setup lets the principal modify the certificate templates to allow enrollment as any targeted AD forest user or computer without knowing their credentials, and impersonation of those targets by certificate authentication.\n\n该实体有特权对目标域进行ADCS ESC4攻击。\n\n本金有权修改一个或多个证书模板上的设置，使主体能够为ADCS ESC1条件配置证书模板，这使他们可以指定替代主题名称并使用证书进行身份验证。他们还获得了企业CA的注册许可，并发表了必要的模板。该企业CA被信任NT身份验证和链条，直到森林的根CA。此设置使主体可以修改证书模板，以便在不知道其凭据的情况下作为任何有针对性的AD森林用户或计算机注册，并通过证书身份验证对这些目标进行模仿。",
    "ADCSESC3": "This entity has the capability to perform the ADCS ESC3 attack against the domain target object.The principal has permission to enroll on a certificate allowing them to obtain an enrollment agent certificate. They also have permission to enroll for a certificate template that permits enrollment by enrollment agents and can be used for authentication. Additionally, they also have enrollment permissions for an enterprise CA with the necessary templates published. This enterprise CA is trusted for NT authentication in the forest, along with the CA certificate chain up to the root CA certificate. This setup lets the principal enroll certificates for any AD forest user or computer, enabling authentication and impersonation of any AD forest user or computer without their credentials, unless the target user or computer is protected by enrollment agent restrictions on the enterprise CA.\n\n该实体有能力针对域目标对象执行ADCS ESC3攻击。本金有权注册证书，允许他们获得注册代理证书。他们还有权注册证书模板，该模板允许注册代理注册，可用于身份验证。此外，他们还具有发表必要模板的企业CA的注册权限。该企业CA在森林中的NT身份验证以及CA证书链中被信任，直到根CA证书。此设置使任何AD森林用户或计算机的主要注册证书可以在没有凭据的情况下对任何AD森林用户或计算机的身份验证和模拟，除非目标用户或计算机受到企业CA的注册代理限制的保护。",
    "ADCSESC6a": "This entity has the privileges to perform the ADCS ESC6 Scenario A attack against the target domain.The principal has permission to enroll on one or more certificate templates allowing for authentication. They also have enrollment permission for an enterprise CA with the necessary templates published. This enterprise CA is trusted for NT authentication in the forest, and chains up to a root CA for the forest. The enterprise CA is configured with the EDITF_ATTRIBUTESUBJECTALTNAME2 flag allowing enrollees to specify a Subject Alternate Name (SAN) identifying another principal during certificate enrollment of any published certificate template. This setup allow an attacker principal to obtain a malicious certificate as any AD forest user or computer and use it for authentication and impersonation without knowing their credentials.\n\n该实体有特权执行ADCS ESC6场景对目标域进行攻击。本金有权注册一个或多个允许进行身份验证的证书模板。他们还获得了企业CA的注册许可，并发表了必要的模板。该企业CA在森林中的NT身份验证是可信赖的，并将其链条延伸至森林的根CA。企业CA配置为Editf_attributesutsuptaltname2标志，允许注册人指定主题替代名称（SAN）在任何已发布的证书模板的证书注册期间识别另一个主体。此设置允许攻击者本金作为任何AD森林用户或计算机获得恶意证书，并在不知道其凭据的情况下将其用于身份验证和模仿。",
    "ADCSESC6b": "This entity has the privileges to perform the ADCS ESC6 Scenario B attack against the target domain.The principal has permission to enroll on one or more certificate templates allowing for authentication. They also have enrollment permission for an enterprise CA with the necessary templates published. This enterprise CA is trusted for NT authentication in the forest, and chains up to a root CA for the forest. The enterprise CA is configured with the EDITF_ATTRIBUTESUBJECTALTNAME2 flag allowing enrollees to specify a Subject Alternate Name (SAN) identifying another principal during certificate enrollment of any published certificate template. This setup allow an attacker principal to obtain a malicious certificate as another principal. There is an affected Domain Controller configured to allow weak certificate mapping enforcement, which enables the attacker principal to authenticate with the malicious certificate and thereby impersonating any AD forest user or computer without their credentials.\n\n该实体有权对目标域进行ADCS ESC6方案B攻击。本金有权注册一个或多个允许进行身份验证的证书模板。他们还获得了企业CA的注册许可，并发表了必要的模板。该企业CA在森林中的NT身份验证是可信赖的，并将其链条延伸至森林的根CA。企业CA配置为Editf_attributesutsuptaltname2标志，允许注册人指定主题替代名称（SAN）在任何已发布的证书模板的证书注册期间识别另一个主体。此设置允许攻击者校长获得恶意证书作为另一位校长。有一个受影响的域控制器配置为允许弱证书映射执行，这使攻击者本金能够使用恶意证书进行身份验证，从而在没有其凭据的情况下模仿任何AD森林用户或计算机。",
    "ADCSESC9a": "This entity has the privileges to perform the ADCS ESC9 Scenario A attack against the target domain.The principal has control over a victim principal with permission to enroll on one or more certificate templates, configured to: 1) enable certificate authentication, 2) require the userPrincipalName (UPN) of the enrollee included in the Subject Alternative Name (SAN), and 3) do not have the security extension enabled. The victim also has enrollment permission for an enterprise CA with the necessary templates published. This enterprise CA is trusted for NT authentication in the forest, and chains up to a root CA for the forest. There is an affected Domain Controller (DC) configured to allow weak certificate binding enforcement. This setup lets the principal impersonate any AD forest principal (user or computer) without their credentials.The attacker principal can abuse their control over the victim principal to modify the victim’s UPN to match the sAMAccountName of a targeted principal. Example: If the targeted principal is Administrator@corp.local user, the victim's UPN will be populated with \"Administrator\" (without the @corp.local ending). The attacker principal will then abuse their control over the victim principal to obtain the credentials of the victim principal, or a session as the victim principal, and enroll a certificate as the victim in one of the affected certificate templates. The UPN of the victim (\"Administrator\") will be included in the issued certificate under the SAN. As the certificate template does not have the security extension, it will NOT include the SID of the victim user in the issued certificate. Next, the attacker principal will again set the UPN of the victim, this time to an arbitrary string (e.g. the original value). The issued certificate can now be used for authentication against an affected DC. The weak certificate binding configuration on the DC will make the DC accept that the SID of the victim user is not present in the issued certificate when performing Kerberos authentication, and it will use the SAN value to map the certificate to a principal. The DC will attempt to find a principal with a UPN matching the SAN value (“Administrator”) but as the victim’s UPN has been changed after the enrollment, there will be no principals with this UPN. The DC will then attempt to find a principal with a sAMAccountName matching the SAN value and find the targeted user. At last, the DC issues a Kerberos TGT as the targeted user to the attacker, which means the attacker now has a session as the targeted user. In case the target is a computer, the DC will find it as well as the DC will attempt sAMAccountName matching with a $ at the end of the SAN value as last resort.\n\n该实体有特权执行ADCS ESC9场景对目标领域的攻击。主管对受害者主管的控制权有许可，可以注册一个或多个证书模板，配置为：1）启用userprincipalname（UPN）的启用extriention exterine offernation exteriasity的证书身份验证，启用了替代名称（san）和3）。受害人还拥有企业CA的招生许可，并发表了必要的模板。该企业CA在森林中的NT身份验证是可信赖的，并将其链条延伸至森林的根CA。有一个受影响的域控制器（DC）配置为允许弱证书绑定执行。这种设置使校长可以在没有凭证的情况下模仿任何AD森林校长（用户或计算机）。攻击者校长可以滥用对受害者校长的控制，以修改受害者的UPN，以匹配目标校长的Samaccountname。示例：如果目标委托人是管理员 @corp.Local用户，则受害者的UPN将带有“管理员”（没有 @corp.local结束）。然后，攻击者校长将滥用对受害者校长的控制权，以获得受害者校长的证书，或作为受害者校长的会议，并将证书作为受害者授予其中一个受影响的证书模板。受害者的UPN（“管理员”）将包括在SAN下的已发行证书中。由于证书模板没有安全性扩展名，因此它不会在已发行的证书中包括受害者用户的SID。接下来，攻击者校长将再次设置受害者的UPN，这次是任意字符串（例如原始值）。现在，已发行的证书可用于针对受影响的DC的身份验证。DC上的弱证书绑定配置将使DC接受受害者用户的SID在执行Kerberos身份验证时不存在于已发行的证书中，并且它将使用SAN值将证书映射到主体。DC将试图找到一个与UPN相匹配的校长（“管理员”），但是由于受害者的UPN在入学后已更改，因此UPN不会有校长。然后，DC将尝试找到具有符合SAN值的SAMACCOUNTNAME的主体并找到目标用户。最后，DC向攻击者发行Kerberos TGT作为目标用户，这意味着攻击者现在有一个会话作为目标用户。如果目标是计算机，则DC将发现它以及DC将尝试与SAN值末尾的$ a samaccountname匹配，作为最后的度假胜地。",
    "ADCSESC9b": "This entity has has the privileges to perform the ADCS ESC9 Scenario B attack against the target domain.\n\nThe principal has control over a victim computer with permission to enroll on one or more certificate templates, configured to: 1) enable certificate authentication, 2) require the dNSHostName of the enrollee included in the Subject Alternative Name (SAN), and 3) not have the security extension enabled. The victim computer also has enrollment permission for an enterprise CA with the necessary templates published. This enterprise CA is trusted for NT authentication in the forest, and chains up to a root CA for the forest. There is an affected Domain Controller (DC) configured to allow weak certificate binding enforcement. This setup lets the principal impersonate any AD forest computer without their credentials.\n\nThe attacker principal can abuse their control over the victim computer to modify the victim computer's dNSHostName attribute to match the dNSHostName of a targeted computer. The attacker principal will then abuse their control over the victim computer to obtain the credentials of the victim computer, or a session as the victim computer, and enroll a certificate as the victim in one of the affected certificate templates. The dNSHostName of the victim will be included in the issued certificate under SAN DNS name. As the certificate template does not have the security extension, the issued certificate will NOT include the SID of the victim computer. DCs with strong certificate binding configuration will require a SID to be present in a certificate used for Kerberos authentication, but the affected DCs with weak certificate binding configuration will not. The affected DCs will split the SAN DNS name into a computer name and a domain name, confirm that the domain name is correct, and use the computer name appended a $ to identify principals with a matching sAMAccountName. At last, the DC issues a Kerberos TGT as the targeted computer to the attacker, which means the attacker now has a session as the targeted computer.\n\n该实体有权对目标域进行ADCS ESC9场景B攻击。\n\n本金具有对受害者计算机的控制权，并有权注册一个或多个证书模板，配置为：1）启用证书身份验证，2）需要主题替代名称（SAN）和3）没有启用安全性扩展名中的注册者的DNShostName。受害者计算机还拥有企业CA的注册许可，并发表了必要的模板。该企业CA在森林中的NT身份验证是可信赖的，并将其链条延伸至森林的根CA。有一个受影响的域控制器（DC）配置为允许弱证书绑定执行。这种设置使主要的没有其凭据模仿任何AD森林计算机。\n\n攻击者校长可以滥用对受害者计算机的控制，以修改受害者计算机的DNShostName属性，以匹配目标计算机的DNShostName。然后，攻击者校长将滥用对受害者计算机的控制权，以获取受害者计算机的凭据，或作为受害者计算机的会话，并将证书作为受害者注册为受影响的一个受影响的证书模板。受害人的DNShostname将以SAN DNS名称包括在已发行的证书中。由于证书模板没有安全性扩展名，因此已发行的证书将不包括受害者计算机的SID。具有强证书绑定配置的DC将需要在用于Kerberos身份验证的证书中存在SID，但是具有弱证书绑定配置的受影响的DC不会。受影响的DCS将SAN DNS名称分为计算机名称和域名，请确认域名正确，并使用计算机名称附加了$以识别具有匹配的SamacCountName的校长。最后，DC向攻击者发出Kerberos TGT作为目标计算机，这意味着攻击者现在将会话作为目标计算机。",
    "ADCSESC10a": "This entity has has the privileges to perform the ADCS ESC10 Scenario A attack against the target domain.\n\nThe principal has control over a victim principal with permission to enroll on one or more certificate templates, configured to enable certificate authentication and require the userPrincipalName (UPN) of the enrollee included in the Subject Alternative Name (SAN). The victim also has enrollment permission for an enterprise CA with the necessary templates published. This enterprise CA is trusted for NT authentication in the forest, and chains up to a root CA for the forest. There is an affected Domain Controller (DC) configured to allow UPN certificate mapping. This setup lets the principal impersonate any AD forest computer, or any user where UPN does not match their sAMAccountName, without knowing their credentials.\n\nThe attacker principal can abuse their control over the victim principal to modify the victim’s UPN to match the sAMAccountName of a targeted principal followed by @CORP.LOCAL. Example: If the targeted principal is Administrator user of domain CORP.LOCAL, the victim's UPN will be populated with \"Administrator@CORP.LOCAL\". The attacker principal will then abuse their control over the victim principal to obtain the credentials of the victim principal, or a session as the victim principal, and enroll a certificate as the victim in one of the affected certificate templates. The UPN of the victim (\"Administrator@CORP.LOCAL\") will be included in the issued certificate under the SAN. Next, the attacker principal will again set the UPN of the victim, this time to an arbitrary string (e.g. the original value). The issued certificate can now be used for authentication against an affected DC. The UPN certificate mapping configuration on the DC make the DC use the SAN value to map the certificate to a principal when performing Schannel authentication. The DC will attempt to find a principal with a UPN matching the SAN value (“Administrator@CORP.LOCAL”) but as the victim’s UPN has been changed after the enrollment, there will be no principals with this UPN. The DC will then attempt to find a principal with a sAMAccountName matching the SAN value and find the targeted user. In case the target is a computer, the DC will find it as well as the DC will attempt sAMAccountName matching with a $ at the end of the SAN value as last resort. At last, the DC will authenticate the attacker as the targeted principal.\n\n该实体有权执行ADCS ESC10方案对目标域进行攻击。\n\n本金具有对受害者委托人的控制权，并有权注册一个或多个证书模板，该模板配置为启用证书身份验证，并要求主题替代名称（SAN）中包含的注册者的用户principalname（UPN）。受害人还拥有企业CA的招生许可，并发表了必要的模板。该企业CA在森林中的NT身份验证是可信赖的，并将其链条延伸至森林的根CA。配置有一个受影响的域控制器（DC），以允许UPN证书映射。此设置使主要的主体可以模仿任何AD森林计算机，或者在不知道其凭据的情况下UPN与SAMACCOUNTNAME不符的任何用户。\n\n攻击者校长可以滥用对受害者校长的控制权，以修改受害者的UPN，以匹配目标校长的samaccountname，然后是 @corp.local。示例：如果目标委托人是域Corp.Local的管理员用户，则受害者的UPN将以“管理员@corp.local”填充。然后，攻击者校长将滥用对受害者校长的控制权，以获得受害者校长的证书，或作为受害者校长的会议，并将证书作为受害者授予其中一个受影响的证书模板。受害者的UPN（“管理员@corp.local”）将包括在SAN下的已发行证书中。接下来，攻击者校长将再次设置受害者的UPN，这次是任意字符串（例如原始值）。现在，已发行的证书可用于针对受影响的DC的身份验证。DC上的UPN证书映射配置使DC使用SAN值在执行Schannel身份验证时将证书映射到主体。DC将试图找到一个与SAN值相匹配的校长（“管理员@corp.local”），但是由于受害者的UPN在入学后已更改，因此UPN不会有校长。然后，DC将尝试找到具有符合SAN值的SAMACCOUNTNAME的主体并找到目标用户。如果目标是计算机，则DC将发现它以及DC将尝试与SAN值末尾的$ a samaccountname匹配，作为最后的度假胜地。最后，DC将验证攻击者为目标本金。",
    "ADCSESC10b": "This entity has has the privileges to perform the ADCS ESC10 Scenario B attack against the target domain.\n\nThe principal has control over a victim computer with permission to enroll on one or more certificate templates, configured to enable certificate authentication, and require the dNSHostName of the enrollee included in the Subject Alternative Name (SAN). The victim computer also has enrollment permission for an enterprise CA with the necessary templates published. This enterprise CA is trusted for NT authentication in the forest, and chains up to a root CA for the forest. There is an affected Domain Controller (DC) configured to allow UPN certificate mapping. This setup lets the principal impersonate any AD forest computer without their credentials.\n\nThe attacker principal can abuse their control over the victim computer to modify the victim computer's dNSHostName attribute to match the dNSHostName of a targeted computer. The attacker principal will then abuse their control over the victim computer to obtain the credentials of the victim computer, or a session as the victim computer, and enroll a certificate as the victim in one of the affected certificate templates. The dNSHostName of the victim will be included in the issued certificate under SAN DNS name. The UPN certificate mapping configuration on the affected DCs make it possible to authenticate over Schannel as the targeted computer. The DC will split the SAN DNS name into a computer name and a domain name, confirm that the domain name is correct, and use the computer name appended a $ to identify a computer with matching sAMAccountName which the attacker will be authenticated as.\n\n该实体有权对目标域进行ADCS ESC10场景B攻击。\n\n本金具有对受害者计算机的控制权，并有权注册一个或多个证书模板，并配置为启用证书身份验证，并需要主题替代名称（SAN）中包含的注册者的DNShostName。受害者计算机还拥有企业CA的注册许可，并发表了必要的模板。该企业CA在森林中的NT身份验证是可信赖的，并将其链条延伸至森林的根CA。配置有一个受影响的域控制器（DC），以允许UPN证书映射。这种设置使主要的没有其凭据模仿任何AD森林计算机。\n\n攻击者校长可以滥用对受害者计算机的控制，以修改受害者计算机的DNShostName属性，以匹配目标计算机的DNShostName。然后，攻击者校长将滥用对受害者计算机的控制权，以获取受害者计算机的凭据，或作为受害者计算机的会话，并将证书作为受害者注册为受影响的一个受影响的证书模板。受害人的DNShostname将以SAN DNS名称包括在已发行的证书中。受影响的DC上的UPN证书映射配置使得可以通过Schannel作为目标计算机进行身份验证。DC将将SAN DNS名称拆分为计算机名称和域名，请确认域名正确，并使用附加的计算机名称来识别具有匹配的SamacCountName的计算机，攻击者将被对此进行身份验证。",
    "ADCSESC13": "The  controlled object has the privileges to perform the ADCS ESC13 abuse against the target AD group. The principal has enrollment rights on a certificate template configured with an issuance policy extension. The issuance policy has an OID group link to an AD group. The principal also has enrollment permission for an enterprise CA with the necessary template published. This enterprise CA is trusted for NT authentication and chains up to a root CA for the forest. This setup allows the principal to enroll a certificate that the principal can use to obtain access to the environment as a member of the group specified in the OID group link.\n\n受控对象有特权对目标广告组进行ADCS ESC13滥用。本金具有配置的发行策略扩展的证书模板的注册权。发行政策具有与广告组的OID组链接。本金还拥有企业CA的注册许可，并发表了必要的模板。该企业CA被信任NT身份验证和链条，直到森林的根CA。此设置允许本金可以注册本金可以用来获取对环境访问的证书，作为OID组链接中指定的组成员。",
    "ManageCA": "The principal controlled object has the \"Manage CA\", also known as \"CA Administrator\", permission on the EnterpriseCA. This permission allows the principal to configure the CA to allow subject alternate names, publish certificate templates, grant \"Manage Certificates\" and more.\n\n主控制对象具有“管理CA”，也称为“ CA Administrator”，该对象对Enterpriseca的许可。此权限允许本金配置CA以允许主题替代名称，发布证书模板，授予“管理证书”等等。",
    "ManageCertificates": "The principal controlled object has the \"Manage Certificates\", also known as \"CA Officer\", permission on the Enterprise CA. This permission allows the principal to force the CA to issue certificates that the CA had previously denied issuance of.\n\n主管受控对象具有“管理证书”，也称为“ CA官员”，该企业CA允许。此许可使委托人能够迫使CA签发CA先前否认发行的证书。",
    "WritePKIEnrollmentFlag": "This entity has the ability to write to the msPKI-Enrollment-Flag attribute on the  target object, which allows the principal to configure \"manager approval\" for the certificate template and other settings.\n\n该实体能够在目标对象上写入MSPKI-Enrollment-Flag属性，该属性允许主体为证书模板和其他设置配置“经理批准”。",
    "WritePKINameFlag": "This entity has the ability to write to the msPKI-Certificate-Name-Flag attribute on the  target object, which allows the principal to configure \"enrollee supplies subject\" for the certificate template among other settings.\n\n该实体能够在目标对象上写入MSPKI-Certificate-name-flag属性，该属性允许主体在其他设置和其他设置中为证书模板配置“注册供应主题”。",
    "DCFor": "This edge indicates that the computer is a domain controller for the domain. This edge is not created for read-only domain controllers.\n\n此边缘表明计算机是域的域控制器。该边缘不是为仅读取域控制器创建的。",
    "OIDGroupLink": "The IssuancePolicy controlled object has an OID group link to the group target object. Certificate templates may include controlled object as an issuance policy extension. Users authenticating using a certificate of such a certificate template will be granted access as a member of the target object group.\n\nissuancePolicy Controled对象具有指向组目标对象的OID组链接。证书模板可以将受控的对象作为发行策略扩展。使用此类证书模板证书进行认证的用户将作为目标对象组的成员授予访问权限。",
    "ExtendedByPolicy": "Certificates of the certificate template controlled object will include the issuance policy target object as a certificate extension.\n\n证书模板控制对象的证书将包括发行策略目标对象作为证书扩展名。",
    "SyncedToADUser": "The Entra user is synchronized to the on-prem AD user.The Entra user may be able to authenticate as the on-prem AD user with its own password if password write-back is enabled. The Entra user may already have the same password as the on-prem user if password hash synchronization is enabled.\n\nENTRA用户与本地广告用户同步。如果启用了密码写入，ENTRA用户可能能够作为本地广告用户身份验证作为本地广告用户。如果启用了密码哈希同步，则ENTRA用户可能已经具有与本地用户相同的密码。",
    "SyncedToEntraUser": "The on-prem AD user is synchronized to the Entra ID user.The on-prem user may be able to authenticate as the Entra user with its own password if password hash synchronization, pass-through authentication, or seamless single sign-on is enabled.\n\n本地广告用户与ENTRA ID用户同步。如果启用密码哈希同步，通行证身份验证或启用无缝的单点登录，则本地用户可以用自己的密码作为ENTRA用户身份验证。",
    "CoerceAndRelayNTLMToSMB": "This edge indicates that an attacker with \"Authenticated Users\" access can compromise the target computer by relaying the NTLM authentication of a victim computer with administrative rights on the target computer. The attack is possible because the attacker can trigger SMB-based coercion from the victim computer to their attacker-controlled host, and the target computer does not enforce SMB signing.Click on Relay Sources to view valid computers with administrative rights on the target computer that can be relayed. Click on Composition to view the full paths that lead to administrative rights on the target computer.\n\n该边缘表明具有“认证用户”访问的攻击者可以通过将受害者计算机的NTLM身份验证带有目标计算机上的管理权，从而损害目标计算机。攻击之所以可能是因为攻击者可以从受害者计算机触发基于SMB的胁迫到其攻击者控制的主机，并且目标计算机不强制执行SMB签名。关注中继源以在目标计算机上查看具有行政权利的有效计算机，该计算机可以继承。单击构图以查看导致目标计算机行政权限的完整路径。",
    "CoerceAndRelayNTLMToLDAP": "This edge indicates that the target computer has the WebClient service running. This enables an attacker with \"Authenticated Users\" access to trigger WebClient-based coercion from the target computer to their attacker-controlled host via NTLM. Since the connection originates from the WebClient instead of SMB, the attacker can relay the authentication attempt to the LDAP service of a domain controller that does not require LDAP signing. This relay can be used to abuse Active Directory permissions or obtain administrative access to the target computer using Resource-Based Constrained Delegation (RBCD) or Shadow Credentials.Click on Relay Targets to view the domain controllers in the domain that do not require LDAP signing.\n\n此边缘表明目标计算机的网络电视服务运行。这样一来，通过NTLM从目标计算机到其攻击者控制的主机，可以通过“经过身份验证的用户”访问“身份验证的用户”访问基于WebClient的胁迫。由于该连接源自网络电量而不是SMB，因此攻击者可以将身份验证尝试转移到不需要LDAP签名的域控制器的LDAP服务。该继电器可用于滥用Active Directory权限或使用基于资源的约束委托（RBCD）或Shadow凭据获得对目标计算机的管理访问权限。在中继目标上单击以查看不需要LDAP签名的域中的域控制器。",
    "CoerceAndRelayNTLMToLDAPS": "This edge indicates that the target computer has the WebClient service running. This enables an attacker with \"Authenticated Users\" access to trigger WebClient-based coercion from the target computer to their attacker-controlled host via NTLM. Since the connection originates from the WebClient instead of SMB, the attacker can relay the authentication attempt to LDAPS of a domain controller that does not require LDAPS channel binding. This relay can be used to abuse Active Directory permissions or obtain administrative access to the target computer using Resource-Based Constrained Delegation (RBCD) or Shadow Credentials.Click on Relay Targets to view the domain controllers in the domain that do not require LDAPS channel binding.\n\n此边缘表明目标计算机的网络电视服务运行。这样一来，通过NTLM从目标计算机到其攻击者控制的主机，可以通过“经过身份验证的用户”访问“身份验证的用户”访问基于WebClient的胁迫。由于该连接起源于网络电量而不是SMB，因此攻击者可以将身份验证尝试转换为不需要LDAPS通道绑定的域控制器的LDAP。该继电器可用于滥用Active Directory权限或使用基于资源的约束委托（RBCD）或Shadow凭据获得对目标计算机的管理访问权限。在中继目标上单击以查看不需要LDAPS通道绑定的域中的域控制器。",
    "CoerceAndRelayNTLMToADCS": "This edge indicates that an attacker with \"Authenticated Users\" access can trigger SMB-based coercion from the target computer to their attacker-controlled host via NTLM. The authentication attempt from the target computer can then be relayed to an ESC8-vulnerable web enrollment endpoint of an Active Directory Certificate Services (ADCS) enterprise CA server. This allows the attacker to obtain a certificate enabling domain authentication as the target computer.Click on Relay Targets to view vulnerable enterprise CA servers that enable certificate enrollment for the target computer.\n\n该边缘表明具有“经过身份验证的用户”访问的攻击者可以通过NTLM触发基于SMB的胁迫到其攻击者控制的主机。然后，可以将目标计算机的身份验证尝试中继到Active Directory证书服务（ADCS）Enterprise CA服务器的ESC8可验证Web注册终点。这使攻击者可以获得启用域身份验证作为目标计算机的证书。对继电器目标单击可查看易受攻击的企业CA服务器，该服务器可启用目标计算机证书注册。",
    "ClaimSpecialIdentity": "The ClaimSpecialIdentity edge represents the ability to obtain an access token containing a special identity (group) SID. Unlike regular groups, membership in special identities is determined at authentication rather than by an explicit member list.See the Abuse section for specific cases.\n\nSopepecialIdentity边缘代表获得包含特殊身份（组）SID的访问令牌的能力。与普通小组不同，特殊身份的成员资格是在身份验证时而不是通过明确的会员列表确定的。请参阅特定案例的滥用部分。",
    "HasTrustKeys": "The domain controlled object has the trust keys of the trust account target object. The trust account exists because the source domain has an outbound trust to the domain of the trust account.The trust keys can be leveraged to authenticate as the trust account and gain access to the trust account's domain.\n\n域控制的对象具有信任帐户目标对象的信任键。信托帐户之所以存在，是因为源域对信托帐户域具有出站信托。可以利用信托密钥作为信托帐户进行身份验证并访问对信托帐户域的访问权限。"
}